#![allow(bad_style)]

use super::{
    UserStatus,
    MessageType,
    ProxyType,
    SavedataType,
    LogLevel,
    Connection,
    FileControl,
    ConferenceType
};

use super::errors::*;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tox {
    _unused: [u8; 0],
}

#[link(name = "toxcore")]
extern "C" {
    pub fn tox_version_major() -> u32;
    pub fn tox_version_minor() -> u32;
    pub fn tox_version_patch() -> u32;
    pub fn tox_version_is_compatible(major: u32, minor: u32, patch: u32) -> bool;
    pub fn tox_public_key_size() -> u32;
    pub fn tox_secret_key_size() -> u32;
    pub fn tox_conference_uid_size() -> u32;
    pub fn tox_conference_id_size() -> u32;
    pub fn tox_nospam_size() -> u32;
    pub fn tox_address_size() -> u32;
    pub fn tox_max_name_length() -> u32;
    pub fn tox_max_status_message_length() -> u32;
    pub fn tox_max_friend_request_length() -> u32;
    pub fn tox_max_message_length() -> u32;
    pub fn tox_max_custom_packet_size() -> u32;
    pub fn tox_hash_length() -> u32;
    pub fn tox_file_id_length() -> u32;
    pub fn tox_max_filename_length() -> u32;
    pub fn tox_max_hostname_length() -> u32;
}

pub type tox_log_cb = ::std::option::Option<
    unsafe extern "C" fn(
        tox: *mut Tox,
        level: LogLevel,
        file: *const ::std::os::raw::c_char,
        line: u32,
        func: *const ::std::os::raw::c_char,
        message: *const ::std::os::raw::c_char,
        user_data: *mut ::std::os::raw::c_void,
    ),
>;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tox_Options {
    pub ipv6_enabled: bool,
    pub udp_enabled: bool,
    pub local_discovery_enabled: bool,
    pub proxy_type: ProxyType,
    pub proxy_host: *const ::std::os::raw::c_char,
    pub proxy_port: u16,
    pub start_port: u16,
    pub end_port: u16,
    pub tcp_port: u16,
    pub hole_punching_enabled: bool,
    pub savedata_type: SavedataType,
    pub savedata_data: *const u8,
    pub savedata_length: usize,
    pub log_callback: tox_log_cb,
    pub log_user_data: *mut ::std::os::raw::c_void,
}

#[test]
fn bindgen_test_layout_Tox_Options() {
    assert_eq!(
        ::std::mem::size_of::<Tox_Options>(),
        64usize,
        concat!("Size of: ", stringify!(Tox_Options))
    );
    assert_eq!(
        ::std::mem::align_of::<Tox_Options>(),
        8usize,
        concat!("Alignment of ", stringify!(Tox_Options))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).ipv6_enabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(ipv6_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).udp_enabled as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(udp_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tox_Options>())).local_discovery_enabled as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(local_discovery_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).proxy_type as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(proxy_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).proxy_host as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(proxy_host)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).proxy_port as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(proxy_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).start_port as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(start_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).end_port as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(end_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).tcp_port as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(tcp_port)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<Tox_Options>())).hole_punching_enabled as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(hole_punching_enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).savedata_type as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(savedata_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).savedata_data as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(savedata_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).savedata_length as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(savedata_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).log_callback as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(log_callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Tox_Options>())).log_user_data as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Tox_Options),
            "::",
            stringify!(log_user_data)
        )
    );
}

extern "C" {
    pub fn tox_options_get_ipv6_enabled(options: *const Tox_Options) -> bool;
    pub fn tox_options_set_ipv6_enabled(options: *mut Tox_Options, ipv6_enabled: bool);
    pub fn tox_options_get_udp_enabled(options: *const Tox_Options) -> bool;
    pub fn tox_options_set_udp_enabled(options: *mut Tox_Options, udp_enabled: bool);
    pub fn tox_options_get_local_discovery_enabled(options: *const Tox_Options) -> bool;
    pub fn tox_options_set_local_discovery_enabled(
        options: *mut Tox_Options,
        local_discovery_enabled: bool,
    );
    pub fn tox_options_get_proxy_type(options: *const Tox_Options) -> ProxyType;
    pub fn tox_options_set_proxy_type(options: *mut Tox_Options, type_: ProxyType);
    pub fn tox_options_get_proxy_host(options: *const Tox_Options)
        -> *const ::std::os::raw::c_char;
